dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
/**
 ****************************************************************************************
 *
 * @file DA14531_Quuppa_DF_BckChn_FlexBeacon.c
 *
 * @brief DA14531_Quuppa_DF_BckChn_FlexBeacon project source code.
 *
 * Copyright (C) 2015-2020 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 ****************************************************************************************
 */

/**
 ****************************************************************************************
 * @addtogroup APP
 * @{
 ****************************************************************************************
 */

/*
 * INCLUDE FILES
 ****************************************************************************************
 */
#include "da1458x_config_basic.h"
#include "arch_console.h"
#include "rwip_config.h"             // SW configuration
#include "gap.h"
#include "app_easy_timer.h"
#include "DA14531_Quuppa_DF_BckChn_FlexBeacon.h"
//#include "user_custs1_impl.h"
//#include "user_custs1_def.h"
#include "co_bt.h"
#include "rf_531.h"

#include "port_bmi270.h"

#include "adc.h"
#include "battery.h"

#ifdef HAS_WKUP_KEYS
#include "wkup_keys.h"
#endif // HAS_WKUP_KEYS

#ifdef CFG_PRINTF // If UART debug is enabled SysTick Timer is used to get Timestamps
#include "uart_utils.h"

#include "systick.h"

#define SYSTICK_PERIOD_US   15000000   // Systick timer is 24bit(max value 16.777.215), period for systick timer in us, so 15.000.000 ticks = 15 seconds
#define SYSTICK_EXCEPTION   0          // do not generate exceptions

/**
 ****************************************************************************************
 * @brief SysTick ISR routine
 ****************************************************************************************
 */
static void systick_isr(void)
{
}

void systick_init(void)
{
    systick_register_callback(systick_isr);
    // Systick will be initialized to use a reference clock frequency of 1 MHz
    systick_start(SYSTICK_PERIOD_US, SYSTICK_EXCEPTION);
}
#endif


/*
 * TYPE DEFINITIONS
 ****************************************************************************************
 */

// Manufacturer Specific Data ADV structure type
struct mnf_specific_data_ad_structure
{
    uint8_t ad_structure_size;
    uint8_t ad_structure_type;
    uint8_t company_id[APP_AD_MSD_COMPANY_ID_LEN];
    uint8_t proprietary_data[APP_AD_MSD_DATA_LEN];
};

struct scan_configuration {
    /// Operation code.
    uint8_t     code;
    /// Own BD address source of the device
    uint8_t     addr_src;
    /// Scan interval
    uint16_t    interval;
    /// Scan window size
    uint16_t    window;
    /// Scanning mode
    uint8_t     mode;
    /// Scan filter policy
    uint8_t     filt_policy;
    /// Scan duplicate filtering policy
    uint8_t     filter_duplic;
};

static const struct scan_configuration user_scan_conf ={
    /// Operation code.
    .code = GAPM_SCAN_PASSIVE,
    /// Own BD address source of the device
    .addr_src = GAPM_STATIC_ADDR,
    /// Scan interval
    .interval = SCAN_INTERVAL_MS,                     
    /// Scan window size
    .window = SCAN_WINDOW_MS,                         
    /// Scanning mode
    .mode = GAP_OBSERVER_MODE,
    /// Scan filter policy
    .filt_policy = SCAN_ALLOW_ADV_ALL,
    /// Scan duplicate filtering policy
    .filter_duplic = SCAN_FILT_DUPLIC_DIS
};

/*
 * GLOBAL VARIABLE DEFINITIONS
 ****************************************************************************************
 */

uint8_t app_connection_idx                                __SECTION_ZERO("retention_mem_area0");

timer_hnd user_periodic_rx_on_timer                       __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
timer_hnd user_rx_on_cancel_timer                         __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
timer_hnd user_rsp_cancel_timer                           __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
timer_hnd user_scan_cancel_timer                          __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
timer_hnd user_enable_extended_sleep_timer                __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
timer_hnd user_dev_info_cancel_timer                      __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY

timer_hnd app_param_update_request_timer_used             __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
timer_hnd app_push_button_timer                           __SECTION_ZERO("retention_mem_area0");

advertising_state adv_state                               __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
advertising_state adv_state_before_sleep                  __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t user_periodic_timer_init_once                     __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t cancel_motion_adv                                 __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
static advertising_state adv_state_before                 __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY

extern last_ble_evt arch_rwble_last_event;
uint16_t ui16temperature_k;
uint16_t ui16battery_CR2032_mv;
uint8_t ui8status;

// Retained variables
struct mnf_specific_data_ad_structure mnf_data            __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t own_bd_addr[6]                                    __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t report_data[ADV_DATA_LEN + 1]                     __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
bool req_found                                            __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
// Index of manufacturer data in advertising data or scan response data (when MSB is 1)
uint8_t mnf_data_index                                    __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t stored_adv_data_len                               __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t stored_scan_rsp_data_len                          __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t stored_adv_data[ADV_DATA_LEN]                     __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t stored_scan_rsp_data[SCAN_RSP_DATA_LEN]           __SECTION_ZERO("retention_mem_area0"); //@RETENTION MEMORY
uint8_t user_led_on_display                               __SECTION_ZERO("retention_mem_area0");
extern bool led_state;
uint32_t actual_size;

