dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
/*
 * FUNCTION DEFINITIONS
 ****************************************************************************************
*/

#define TOPBIT   (((uint8_t)1) << 7)

/*********************************************************************
 * Function:    CalculateCRC()
 * Description: Calculate the CRC-8 value withouth a lookup table
 *              with Initial value 0x00, Polinomial 0x97
 * Returns:		  The CRC of the Data array
 *********************************************************************/
uint8_t CalculateCRC(uint8_t const Data[], uint16_t nrBytes)
{
    uint8_t	CRCValue = 0x00;
    int16_t i,j;

    for (i = 0; i < nrBytes; i++)
    {
        CRCValue = CRCValue ^ Data[i];			
			  for (j = 0; j < 8; j++) {
					if ((CRCValue & TOPBIT) !=0) {
            CRCValue = (uint8_t)((CRCValue << 1) ^ 0x97);
					}
					else {
            CRCValue = (CRCValue << 1);
					}
        }
    }
    return (CRCValue ^ 0x00);
}

static void get_device_info(void)
{

	int8_t i8temperature_c;
	
	// Measure Temperature using internal temp sensor
	adc_config_t temp_config = 
	{
			.input_mode = ADC_INPUT_MODE_SINGLE_ENDED,
			.input = ADC_INPUT_SE_TEMP_SENS,
	};
			
	adc_init(&temp_config);						
	i8temperature_c = adc_get_temp();						
	adc_disable();
	
	// Calculate Temperature in K according to Quuppa formula
	// (hex)(TempC + 273.15)*10; example (20.0C + 273.15)*10 = 2931.5 (hex)(2932)=0x0B74 
	ui16temperature_k = (uint16_t)((i8temperature_c + 273.15)*10);

	// Measure Battery voltage assuming it's a CR2032
	ui16battery_CR2032_mv = battery_get_voltage(BATT_CR2032);

	ui8status = 0;

	if(ui16battery_CR2032_mv < 2500)
	{
		ui8status = (ui8status & ~(1UL << 0)) | (1 << 0); // Battery voltage <2500 mV => Status bit 0 (Battery Alarm) = 1
	}

	if(!GPIO_GetPinStatus(PUSH_BUTTON_1_PORT, PUSH_BUTTON_1_PIN))  // Read the current status of Button (if pressed = Low)
	{
		ui8status = (ui8status & ~(1UL << 1)) | (1 << 1); // Button is pressed => Status bit 1 (Btn1) = 1
	}

	#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1) 
	 uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	 arch_printf("\n\r[%08d us] 5.Status: %d, Battery Voltage[mV]: %d, Temp[C]: %d, Temp[K]: 0x%04X, ", current_sys_tick, ui8status, ui16battery_CR2032_mv, i8temperature_c, ui16temperature_k);
	#endif

}



/**
 ****************************************************************************************
 * @brief Initialize Manufacturer Specific Data for Direction Finding Payload
 * @return void
 ****************************************************************************************
 */
static void df_adv_data_init()
{
  	mnf_data.ad_structure_size = sizeof(struct mnf_specific_data_ad_structure ) - sizeof(uint8_t); // minus the size of the ad_structure_size field
    mnf_data.ad_structure_type = GAP_AD_TYPE_MANU_SPECIFIC_DATA;
    mnf_data.company_id[0] = APP_AD_MSD_COMPANY_ID & 0xFF; // LSB (APP_AD_MSD_COMPANY_ID >> 8 )& 0xFF; // MSB
    mnf_data.company_id[1] = (APP_AD_MSD_COMPANY_ID >> 8 )& 0xFF; // MSB
	  mnf_data.proprietary_data[0] = 0x01; // Quuppa Packet ID: 0x01 = Direction Finding; 0xF0 = Data Packet; 0xF2 = RSP Packet; 0xF1 = REQ Packet from locator
    mnf_data.proprietary_data[1] = QUUPPA_DEVICE_TYPE; // Quuppa Device Type
    mnf_data.proprietary_data[2] = 0x68; // Quuppa Header 0x68 = [7] RX ON [0], [6] Bck Chn [1], [5-4] TagID=BDAdd [10],[3-2] 0dBm Tx power [10], [1-0] DF TX Rate(0.2Hz)[00]
    mnf_data.proprietary_data[3] = own_bd_addr[5]; // Quuppa Tag ID [MSB]	
    mnf_data.proprietary_data[4] = own_bd_addr[4]; // Quuppa Tag ID
    mnf_data.proprietary_data[5] = own_bd_addr[3]; // Quuppa Tag ID
    mnf_data.proprietary_data[6] = own_bd_addr[2]; // Quuppa Tag ID
    mnf_data.proprietary_data[7] = own_bd_addr[1]; // Quuppa Tag ID		
    mnf_data.proprietary_data[8] = own_bd_addr[0]; // Quuppa Tag ID [LSB]
    mnf_data.proprietary_data[9] = CalculateCRC(&mnf_data.proprietary_data[1], 8);
    mnf_data.proprietary_data[10] = 0x67; // DF Field 0
    mnf_data.proprietary_data[11] = 0xF7; // DF Field 1	
    mnf_data.proprietary_data[12] = 0xDB; // DF Field 2
    mnf_data.proprietary_data[13] = 0x34; // DF Field 3
    mnf_data.proprietary_data[14] = 0xC4; // DF Field 4
    mnf_data.proprietary_data[15] = 0x03; // DF Field 5		
    mnf_data.proprietary_data[16] = 0x8E; // DF Field 6
    mnf_data.proprietary_data[17] = 0x5C; // DF Field 7
    mnf_data.proprietary_data[18] = 0x0B; // DF Field 8
    mnf_data.proprietary_data[19] = 0xAA; // DF Field 9	
    mnf_data.proprietary_data[20] = 0x97; // DF Field 10
    mnf_data.proprietary_data[21] = 0x30; // DF Field 11
    mnf_data.proprietary_data[22] = 0x56; // DF Field 12
    mnf_data.proprietary_data[23] = 0xE6; // DF Field 13		
}

/**
 ****************************************************************************************
 * @brief Initialize Manufacturer Specific Data for Device Info Payload
 * @return void
 ****************************************************************************************
 */
static void dev_info_adv_data_init()
{
    get_device_info();

		mnf_data.proprietary_data[0] = 0xF0; // Quuppa Packet ID: 0xF0 = Data Packet;
		mnf_data.proprietary_data[1] = 0x00; // Header containing payload counter and Tag ID type (TBD)
		mnf_data.proprietary_data[2] = own_bd_addr[5]; // Quuppa Tag ID [MSB]	
		mnf_data.proprietary_data[3] = own_bd_addr[4]; // Quuppa Tag ID
		mnf_data.proprietary_data[4] = own_bd_addr[3]; // Quuppa Tag ID
		mnf_data.proprietary_data[5] = own_bd_addr[2]; // Quuppa Tag ID
		mnf_data.proprietary_data[6] = own_bd_addr[1]; // Quuppa Tag ID		
		mnf_data.proprietary_data[7] = own_bd_addr[0]; // Quuppa Tag ID [LSB]
		mnf_data.proprietary_data[8] = 0x01;  // Payload Type: 0x01 Device Info 
		mnf_data.proprietary_data[9] = 0x00;  // Version 
		mnf_data.proprietary_data[10] = 0x1B; // Supported features (1 = supported, Bit[7-0]=[RFU, RFU, RFU, Temp, Battery, Btn2=NA=0, Btn1, Battery Alarm])  
		mnf_data.proprietary_data[11] = ui8status; // Status	(Bit[7-0]=[RFU,..., Btn2=NA=0, Btn1(1=pressed), Battery Alarm(0=Battery OK, 1=Battery Low)]) 
		mnf_data.proprietary_data[12] = ui16battery_CR2032_mv & 0xFF; // Battery Voltage [LSB]
		mnf_data.proprietary_data[13] = (ui16battery_CR2032_mv >> 8 )& 0xFF; // Battery Voltage [MSB] => 0x0BB8 = 3.00V (1mV per bit, 0x0000 if not supported and 0 in supp feat bit)
		mnf_data.proprietary_data[14] = ui16temperature_k & 0xFF; // Temperature [LSB]     => Formula (hex)(C + 273.15)*10 => (20.0C + 273.15)*10 = 2931.5 (hex)(2932) = 0x0B74  
		mnf_data.proprietary_data[15] = (ui16temperature_k >> 8 )& 0xFF; // Temperature [MSB]     => 0x0B74 = 20.0C (0.1Kelvin per bit, 0x0000 if not supported and 0 in supp feat bit)		
		mnf_data.proprietary_data[16] = DEVELOPER_ID & 0xFF; // Developer ID [LSB]
		mnf_data.proprietary_data[17] = (DEVELOPER_ID >> 8 )& 0xFF; // Developer ID [MSB]
		mnf_data.proprietary_data[18] = 0x00; // FW Version [LSB]
		mnf_data.proprietary_data[19] = 0x01; // FW Version [MSB]	  => FW verion 1.0
		mnf_data.proprietary_data[20] = 0x00; // HW Version [LSB]
		mnf_data.proprietary_data[21] = 0x01; // HW Version [MSB]	  => HW verion 1.0
		mnf_data.proprietary_data[22] = 0x00; // RFU
		mnf_data.proprietary_data[23] = 0x00; // RFU

