dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
}

/**
 ****************************************************************************************
 * @brief Add an AD structure in the Advertising or Scan Response Data of the
 *        GAPM_START_ADVERTISE_CMD parameter struct.
 * @param[in] cmd               GAPM_START_ADVERTISE_CMD parameter struct
 * @param[in] ad_struct_data    AD structure buffer
 * @param[in] ad_struct_len     AD structure length
 * @param[in] adv_connectable   Connectable advertising event or not. It controls whether
 *                              the advertising data use the full 31 bytes length or only
 *                              28 bytes (Document CCSv6 - Part 1.3 Flags).
 ****************************************************************************************
 */
static void app_add_ad_struct(struct gapm_start_advertise_cmd *cmd, void *ad_struct_data, uint8_t ad_struct_len, uint8_t adv_connectable)
{
    uint8_t adv_data_max_size = (adv_connectable) ? (ADV_DATA_LEN - 3) : (ADV_DATA_LEN);
    
    if ((adv_data_max_size - cmd->info.host.adv_data_len) >= ad_struct_len)
    {
        // Append manufacturer data to advertising data
        memcpy(&cmd->info.host.adv_data[cmd->info.host.adv_data_len], ad_struct_data, ad_struct_len);

        // Update Advertising Data Length
        cmd->info.host.adv_data_len += ad_struct_len;
        
        // Store index of manufacturer data which are included in the advertising data
        mnf_data_index = cmd->info.host.adv_data_len - sizeof(struct mnf_specific_data_ad_structure);
    }
    else if ((SCAN_RSP_DATA_LEN - cmd->info.host.scan_rsp_data_len) >= ad_struct_len)
    {
        // Append manufacturer data to scan response data
        memcpy(&cmd->info.host.scan_rsp_data[cmd->info.host.scan_rsp_data_len], ad_struct_data, ad_struct_len);

        // Update Scan Response Data Length
        cmd->info.host.scan_rsp_data_len += ad_struct_len;
        
        // Store index of manufacturer data which are included in the scan response data
        mnf_data_index = cmd->info.host.scan_rsp_data_len - sizeof(struct mnf_specific_data_ad_structure);
        // Mark that manufacturer data is in scan response and not advertising data
        mnf_data_index |= 0x80;
    }
    else
    {
        // Manufacturer Specific Data do not fit in either Advertising Data or Scan Response Data
        ASSERT_WARNING(0);
    }
    // Store advertising data length
    stored_adv_data_len = cmd->info.host.adv_data_len;
    // Store advertising data
    memcpy(stored_adv_data, cmd->info.host.adv_data, stored_adv_data_len);
    // Store scan response data length
    stored_scan_rsp_data_len = cmd->info.host.scan_rsp_data_len;
    // Store scan_response data
    memcpy(stored_scan_rsp_data, cmd->info.host.scan_rsp_data, stored_scan_rsp_data_len);
}

void toggle_led(void){

	if (led_state){
		user_set_led_state(false);		
	}else{
		user_set_led_state(true);
	}

}

/**
 ****************************************************************************************
 * @brief This cancels advertisments or scans
 * @return void
 ****************************************************************************************
 */
static void user_ble_gap_stop_ongoing_operation(void)
{
	//allocate message space for command
	struct gapm_cancel_cmd *cmd = KE_MSG_ALLOC(GAPM_CANCEL_CMD,
																						TASK_GAPM,
																						TASK_APP, 
																						gapm_cancel_cmd);
	//cancel air operation
	cmd->operation = GAPM_CANCEL;

	ke_msg_send(cmd);
	
}


static void scan_cancell_timer_cb()
{	
	#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
     uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	   arch_printf("\n\r[%08d us] X.Scan_cancell_timer_cb...", current_sys_tick);
	#endif	

	user_scan_cancel_timer = EASY_TIMER_INVALID_TIMER;
	user_ble_gap_stop_ongoing_operation();
}

/**
 ****************************************************************************************
 * @brief Scan for devices
 * @return void
 ****************************************************************************************
 */
static void user_scan_start(void)
{
    struct gapm_start_scan_cmd* cmd = KE_MSG_ALLOC(GAPM_START_SCAN_CMD,
                                                   TASK_GAPM,
                                                   TASK_APP,
                                                   gapm_start_scan_cmd);

    cmd->op.code = user_scan_conf.code;
    cmd->op.addr_src = user_scan_conf.addr_src;
    cmd->interval = user_scan_conf.interval;
    cmd->window = user_scan_conf.window;
    cmd->mode = user_scan_conf.mode;
    cmd->filt_policy = user_scan_conf.filt_policy;
    cmd->filter_duplic =user_scan_conf.filter_duplic;
		
		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
        uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	      arch_printf("\n\r[%08d us] 4.Start Scanning...", current_sys_tick);
		#endif
    // Schedule SCAN cancel timeout
		user_scan_cancel_timer = app_easy_timer(SCAN_CANCEL_TIMER, scan_cancell_timer_cb);
    // Send the message
    ke_msg_send(cmd);
}

/**
 ****************************************************************************************
* @brief RX_ON cancel timer: used to have only one RX_ON adv packet
 * @return void
 ****************************************************************************************
*/
static void rx_on_cancel_timer_cb()
{	
 		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
        uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	      arch_printf("\n\r[%08d us] 3.RX_ON_timer_cancellation_cb...", current_sys_tick);
		#endif	
		user_rx_on_cancel_timer = EASY_TIMER_INVALID_TIMER;
	  adv_state = SCAN;
    app_easy_gap_advertise_stop();
}



/**
 ****************************************************************************************
 * @brief Periodic scan timer callback function.
 * @return void
 ****************************************************************************************
*/
static void periodic_rx_on_timer_cb()
{	
 		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
        uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	      arch_printf("\n\r[%08d us] 1.Periodic_RX_ON_timer_cb...", current_sys_tick);
		#endif	
	
		user_periodic_rx_on_timer = EASY_TIMER_INVALID_TIMER;

