dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
	  // Save current adv state
  	adv_state_before = adv_state;
 
    // change state
  	adv_state = RX_ON_ADVERTISING; //user_change_adv_state(RX_ON_ADVERTISING);
	  app_easy_gap_advertise_stop();
	
}

static void user_enable_extended_sleep_timer_cb()
{	
	  user_enable_extended_sleep_timer = EASY_TIMER_INVALID_TIMER;
			#ifdef CFG_PRINTF
			 arch_printf("\n\n\r SLEEP timer elapsed...");
			#endif
//			  user_change_adv_state(SLEEP);
//			  app_easy_gap_advertise_stop();
				adv_state = SLEEP;
				user_enable_extended_sleep();
				user_ble_gap_stop_ongoing_operation();

}

static void rsp_cancel_timer_cb()
{	
 		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
        uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	      arch_printf("\n\r[%08d us] 8.RSP_timer_cancellation cb...", current_sys_tick);
		#endif	
		user_rsp_cancel_timer = EASY_TIMER_INVALID_TIMER;    

	  user_change_adv_state(DEV_INFO);
    app_easy_gap_advertise_stop();
}

static void dev_info_cancel_timer_cb()
{	
 		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
        uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	      arch_printf("\n\r[%08d us] 9.Dev_info_timer_cancellation cb...", current_sys_tick);
		#endif	
		user_dev_info_cancel_timer = EASY_TIMER_INVALID_TIMER;    
	 if(adv_state_before == MOTION_ADVERTISING &&	cancel_motion_adv == 1)
		 {
			#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
					uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
					arch_printf("\n\r[%08d us] X.Motion_ADV_cancellation...", current_sys_tick);
			#endif
			cancel_motion_adv = 0;
			adv_state_before = STATIC_ADVERTISING;
		 }
		 if(adv_state_before == STATIC_ADVERTISING){
			 user_periodic_rx_on_timer = app_easy_timer(PERIODIC_RX_ON_INTERVAL_STATIC, periodic_rx_on_timer_cb);
		 }else{
			 user_periodic_rx_on_timer = app_easy_timer(PERIODIC_RX_ON_INTERVAL_MOTION, periodic_rx_on_timer_cb);
		 }
	  user_change_adv_state(adv_state_before);
    app_easy_gap_advertise_stop();
}


void user_app_adv_undirect_complete(uint8_t status)
{
		 #if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
        uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	      arch_printf("\n\r[%08d us] X.User_app_adv_undirect_complete...", current_sys_tick);
		 #endif	

    if (status == GAP_ERR_CANCELED)
    {
			switch (adv_state)
			{
				case MOTION_ADVERTISING:
					if (user_dev_info_cancel_timer != EASY_TIMER_INVALID_TIMER)
					{
							app_easy_timer_cancel(user_dev_info_cancel_timer);
							user_dev_info_cancel_timer = EASY_TIMER_INVALID_TIMER;
					}
					user_app_adv_start();
				break;
				case STATIC_ADVERTISING:
					if (user_dev_info_cancel_timer != EASY_TIMER_INVALID_TIMER)
					{
							app_easy_timer_cancel(user_dev_info_cancel_timer);
							user_dev_info_cancel_timer = EASY_TIMER_INVALID_TIMER;
					}
					user_app_adv_start();
				break;
				case RX_ON_ADVERTISING:
					if (user_periodic_rx_on_timer != EASY_TIMER_INVALID_TIMER)
						{
								app_easy_timer_cancel(user_periodic_rx_on_timer);
								user_periodic_rx_on_timer = EASY_TIMER_INVALID_TIMER;
						}
						user_app_adv_start();
				break;				
				case SCAN:
					if (user_rx_on_cancel_timer != EASY_TIMER_INVALID_TIMER)
						{
								app_easy_timer_cancel(user_rx_on_cancel_timer);
								user_rx_on_cancel_timer = EASY_TIMER_INVALID_TIMER;
						}
					user_scan_start();
				break;
			  case SLEEP:
				  user_enable_extended_sleep();
					#ifdef CFG_PRINTF
            arch_puts("\n\n\rAdv Cancel, Sleep case, set arch_ble_ext_wakeup_on...\n");
					#endif
			  break;
				case DEV_INFO:
					if (user_rsp_cancel_timer != EASY_TIMER_INVALID_TIMER)
					{
							app_easy_timer_cancel(user_rsp_cancel_timer);
							user_rsp_cancel_timer = EASY_TIMER_INVALID_TIMER;
					}
					user_app_adv_start();
				default :
				break;			
			}
    }
}

/**
 ****************************************************************************************
 * @brief Parameter update request timer callback function.
 ****************************************************************************************
*/
static void param_update_request_timer_cb()
{
    app_easy_gap_param_update_start(app_connection_idx);
    app_param_update_request_timer_used = EASY_TIMER_INVALID_TIMER;
}

void user_app_init(void)
{
#ifdef CFG_PRINTF
 arch_printf("\n\n\r user_app_init");
#endif
	
		adv_state = MOTION_ADVERTISING;
	  cancel_motion_adv = 0;
	  
    //Reset all timers
  	app_param_update_request_timer_used = EASY_TIMER_INVALID_TIMER;	
		user_enable_extended_sleep_timer = EASY_TIMER_INVALID_TIMER;    
    user_periodic_rx_on_timer = EASY_TIMER_INVALID_TIMER;

    // Get own BD Address
  	uint32_t bdaddr_msb = (GetWord32(BLE_BDADDRU_REG))&0x1FFFF;
    uint32_t bdaddr_lsb = (GetWord32(BLE_BDADDRL_REG));
    memcpy(&own_bd_addr, &bdaddr_lsb, 4);
    memcpy(&own_bd_addr[4], &bdaddr_msb, 2);	
    
    //Set the flag to update periodic timers once
  	user_periodic_timer_init_once = 1;

		user_set_led_state(false);
	
    // Initialize Advertising and Scan Response Data
    memcpy(stored_adv_data, USER_ADVERTISE_DATA, USER_ADVERTISE_DATA_LEN);
    stored_adv_data_len = USER_ADVERTISE_DATA_LEN;
    memcpy(stored_scan_rsp_data, USER_ADVERTISE_SCAN_RESPONSE_DATA, USER_ADVERTISE_SCAN_RESPONSE_DATA_LEN);
    stored_scan_rsp_data_len = USER_ADVERTISE_SCAN_RESPONSE_DATA_LEN;
    
#ifdef CFG_PRINTF
    systick_init();
#endif
    req_found = false;
	  default_app_on_init();
}


/**
 ****************************************************************************************
 * @brief Start undirected motion advertising                
 * @return void
 ****************************************************************************************
*/ 
void user_motion_undirect_adv_start(void)
{
    struct gapm_start_advertise_cmd* cmd;
    cmd = app_easy_gap_undirected_advertise_get_active();
    
		cmd->intv_min = MS_TO_BLESLOTS(MOTION_ADV_INTERVAL);
		cmd->intv_max = MS_TO_BLESLOTS(MOTION_ADV_INTERVAL);
	  cmd->channel_map = ADV_ALL_CHNLS_EN;
		
#if defined (__DA14531__)  // Power output change is possible for DA14531 only
  	rf_pa_pwr_set(MOTION_ADV_POWER);
	  set_recommended_settings();
#endif	
    // Initialize Manufacturer Specific Data with Direction Finding data
    df_adv_data_init();

