dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
	  mnf_data.proprietary_data[2] = MOTION_ADV_HEADER;
    mnf_data.proprietary_data[9] = CalculateCRC(&mnf_data.proprietary_data[1], 8); // Checksum
		
    // Add manufacturer data to initial advertising or scan response data, if there is enough space
    app_add_ad_struct(cmd, &mnf_data, sizeof(struct mnf_specific_data_ad_structure), 1);

		if(user_enable_extended_sleep_timer != EASY_TIMER_INVALID_TIMER)
		{
				app_easy_timer_cancel(user_enable_extended_sleep_timer);
				user_enable_extended_sleep_timer = EASY_TIMER_INVALID_TIMER;		
		}
		user_enable_extended_sleep_timer =	app_easy_timer(TIMEOUT_FOR_SLEEP, user_enable_extended_sleep_timer_cb);
	
    app_easy_gap_undirected_advertise_start();
		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
      systick_stop();
      systick_start(SYSTICK_PERIOD_US, SYSTICK_EXCEPTION);
      uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			arch_printf("\n\n\r[%08d us] 0.Motion Advertising...", current_sys_tick);
		#endif
}

/**
 ****************************************************************************************
 * @brief start static advertising
 * @return void
 ****************************************************************************************
*/ 
void user_static_undirect_adv_start(void)
{
    struct gapm_start_advertise_cmd* cmd;
    cmd = app_easy_gap_undirected_advertise_get_active();
    
		cmd->intv_min = MS_TO_BLESLOTS(STATIC_ADV_INTERVAL);
		cmd->intv_max = MS_TO_BLESLOTS(STATIC_ADV_INTERVAL);
	  cmd->channel_map = ADV_ALL_CHNLS_EN;

#if defined (__DA14531__)  // Power output change is possible for DA14531 only		
		rf_pa_pwr_set(STATIC_ADV_POWER);
		set_recommended_settings();
#endif	
    // Initialize Manufacturer Specific Data with Direction Finding data
    df_adv_data_init();

	  mnf_data.proprietary_data[2] = STATIC_ADV_HEADER;
    mnf_data.proprietary_data[9] = CalculateCRC(&mnf_data.proprietary_data[1], 8); // Checksum = 0x??
		
    // Add manufacturer data to initial advertising or scan response data, if there is enough space
    app_add_ad_struct(cmd, &mnf_data, sizeof(struct mnf_specific_data_ad_structure), 1);

//		if(user_enable_extended_sleep_timer != EASY_TIMER_INVALID_TIMER)
//		{
//				app_easy_timer_cancel(user_enable_extended_sleep_timer);
//				user_enable_extended_sleep_timer = EASY_TIMER_INVALID_TIMER;		
//		}
//		user_enable_extended_sleep_timer =	app_easy_timer(TIMEOUT_FOR_SLEEP, user_enable_extended_sleep_timer_cb);

	
    app_easy_gap_undirected_advertise_start();
		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
      systick_stop();
      systick_start(SYSTICK_PERIOD_US, SYSTICK_EXCEPTION);
      uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			arch_printf("\n\n\r[%08d us] 0.Static Advertising...", current_sys_tick);
		#endif
}

void user_app_adv_start(void)
{
	
	if(user_periodic_timer_init_once)
		 {
  	   user_periodic_timer_init_once = 0;

  		if(user_periodic_rx_on_timer != EASY_TIMER_INVALID_TIMER)
        {
            app_easy_timer_cancel(user_periodic_rx_on_timer);
            user_periodic_rx_on_timer = EASY_TIMER_INVALID_TIMER;		
        }
        // Schedule the next periodic scan to check for REQ packets
        if(adv_state == STATIC_ADVERTISING)
        {
          user_periodic_rx_on_timer = app_easy_timer(PERIODIC_RX_ON_INTERVAL_STATIC, periodic_rx_on_timer_cb);
				}
        else
        {
            user_periodic_rx_on_timer = app_easy_timer(PERIODIC_RX_ON_INTERVAL_MOTION, periodic_rx_on_timer_cb);
        }

//				if(user_enable_extended_sleep_timer != EASY_TIMER_INVALID_TIMER)
//				{
//						app_easy_timer_cancel(user_enable_extended_sleep_timer);
//						user_enable_extended_sleep_timer = EASY_TIMER_INVALID_TIMER;		
//				}

//			  user_enable_extended_sleep_timer =	app_easy_timer(TIMEOUT_FOR_SLEEP, user_enable_extended_sleep_timer_cb);
			
		 } 


	 switch (adv_state)
		{
			case MOTION_ADVERTISING:
				user_motion_undirect_adv_start();
			break;
			case STATIC_ADVERTISING:
				user_static_undirect_adv_start();
			break;
      case RX_ON_ADVERTISING:
				user_rx_on_undirect_adv_start();
			break;				
      case RSP_ADVERTISING:
				user_rsp_undirect_adv_start();
			break;
			case DEV_INFO:
			  user_dev_info_undirect_adv_start();
			break;
			case SLEEP:
			  user_enable_extended_sleep();
			break;
			default :
				user_static_undirect_adv_start();
			break;			
		}

}

void user_app_connection(uint8_t connection_idx, struct gapc_connection_req_ind const *param)
{
    if (app_env[connection_idx].conidx != GAP_INVALID_CONIDX)
    {
        app_connection_idx = connection_idx;

        // Stop the advertising data update timer
        app_easy_timer_cancel(user_periodic_rx_on_timer);

        // Check if the parameters of the established connection are the preferred ones.
        // If not then schedule a connection parameter update request.
        if ((param->con_interval < user_connection_param_conf.intv_min) ||
            (param->con_interval > user_connection_param_conf.intv_max) ||
            (param->con_latency != user_connection_param_conf.latency)  ||
            (param->sup_to != user_connection_param_conf.time_out))
        {
            // Connection params are not these that we expect
            app_param_update_request_timer_used = app_easy_timer(APP_PARAM_UPDATE_REQUEST_TO, param_update_request_timer_cb);
        }
    }
    else
    {
        // No connection has been established, restart advertising
				user_periodic_timer_init_once = 1;
			  if(adv_state_before == MOTION_ADVERTISING)
				{
					cancel_motion_adv = 1;
				}
		    user_change_adv_state(adv_state_before);
			  user_app_adv_start();
    }
  	adv_state_before = adv_state;
    default_app_on_connection(connection_idx, param);
}


void user_app_disconnect(struct gapc_disconnect_ind const *param)
{
    // Cancel the parameter update request timer
    if (app_param_update_request_timer_used != EASY_TIMER_INVALID_TIMER)
    {
        app_easy_timer_cancel(app_param_update_request_timer_used);
        app_param_update_request_timer_used = EASY_TIMER_INVALID_TIMER;
    }
    // Restart Advertising
		
		user_change_adv_state(adv_state_before);
    user_app_adv_start();
}

void user_catch_rest_hndl(ke_msg_id_t const msgid,
                          void const *param,
                          ke_task_id_t const dest_id,
                          ke_task_id_t const src_id)
{
/*     switch(msgid)
    {
        case CUSTS1_VAL_WRITE_IND:
        {
            struct custs1_val_write_ind const *msg_param = (struct custs1_val_write_ind const *)(param);

            switch (msg_param->handle)
            {
                case SVC1_IDX_CONTROL_POINT_VAL:
                    user_svc1_ctrl_wr_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

                case SVC1_IDX_LED_STATE_VAL:
                    user_svc1_led_wr_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

