dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
                case SVC1_IDX_ADC_VAL_1_NTF_CFG:
                    user_svc1_adc_val_1_cfg_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

                case SVC1_IDX_BUTTON_STATE_NTF_CFG:
                    user_svc1_button_cfg_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

                case SVC1_IDX_INDICATEABLE_IND_CFG:
                    user_svc1_long_val_cfg_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

                case SVC1_IDX_LONG_VALUE_NTF_CFG:
                    user_svc1_long_val_cfg_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

                case SVC1_IDX_LONG_VALUE_VAL:
                    user_svc1_long_val_wr_ind_handler(msgid, msg_param, dest_id, src_id);
                    break;

                default:
                    break;
            }
        } break;

        case CUSTS1_VAL_NTF_CFM:
        {
            struct custs1_val_ntf_cfm const *msg_param = (struct custs1_val_ntf_cfm const *)(param);

            switch (msg_param->handle)
            {
                case SVC1_IDX_ADC_VAL_1_VAL:
                    break;

                case SVC1_IDX_BUTTON_STATE_VAL:
                    break;

                case SVC1_IDX_LONG_VALUE_VAL:
                    break;

                default:
                    break;
            }
        } break;

        case CUSTS1_VAL_IND_CFM:
        {
            struct custs1_val_ind_cfm const *msg_param = (struct custs1_val_ind_cfm const *)(param);

            switch (msg_param->handle)
            {
                case SVC1_IDX_INDICATEABLE_VAL:
                    break;

                default:
                    break;
             }
        } break;

        case CUSTS1_ATT_INFO_REQ:
        {
            struct custs1_att_info_req const *msg_param = (struct custs1_att_info_req const *)param;

            switch (msg_param->att_idx)
            {
                case SVC1_IDX_LONG_VALUE_VAL:
                    user_svc1_long_val_att_info_req_handler(msgid, msg_param, dest_id, src_id);
                    break;

                default:
                    user_svc1_rest_att_info_req_handler(msgid, msg_param, dest_id, src_id);
                    break;
             }
        } break;

        case GAPC_PARAM_UPDATED_IND:
        {
            // Cast the "param" pointer to the appropriate message structure
            struct gapc_param_updated_ind const *msg_param = (struct gapc_param_updated_ind const *)(param);

            // Check if updated Conn Params filled to preferred ones
            if ((msg_param->con_interval >= user_connection_param_conf.intv_min) &&
                (msg_param->con_interval <= user_connection_param_conf.intv_max) &&
                (msg_param->con_latency == user_connection_param_conf.latency) &&
                (msg_param->sup_to == user_connection_param_conf.time_out))
            {
            }
        } break;

        case CUSTS1_VALUE_REQ_IND:
        {
            struct custs1_value_req_ind const *msg_param = (struct custs1_value_req_ind const *) param;

            switch (msg_param->att_idx)
            {
                case SVC3_IDX_READ_4_VAL:
                {
                    user_svc3_read_non_db_val_handler(msgid, msg_param, dest_id, src_id);
                } break;

                default:
                {
                    // Send Error message
                    struct custs1_value_req_rsp *rsp = KE_MSG_ALLOC(CUSTS1_VALUE_REQ_RSP,
                                                                    src_id,
                                                                    dest_id,
                                                                    custs1_value_req_rsp);

                    // Provide the connection index.
                    rsp->conidx  = app_env[msg_param->conidx].conidx;
                    // Provide the attribute index.
                    rsp->att_idx = msg_param->att_idx;
                    // Force current length to zero.
                    rsp->length = 0;
                    // Set Error status
                    rsp->status  = ATT_ERR_APP_ERROR;
                    // Send message
                    ke_msg_send(rsp);
                } break;
             }
        } break;

        default:
            break;
    } */
}
/**
 ****************************************************************************************
 * @brief Start rx on undirected advertising                
 * @return void
 ****************************************************************************************
*/ 
void user_rx_on_undirect_adv_start(void)
{
    // Schedule the rx on advertising cancellation
    user_rx_on_cancel_timer = app_easy_timer(RX_ON_CANCEL_TIMER, rx_on_cancel_timer_cb);

	  struct gapm_start_advertise_cmd* cmd;
    cmd = app_easy_gap_undirected_advertise_get_active();
    
		cmd->intv_min = MS_TO_BLESLOTS(RX_ON_ADV_INTERVAL);
		cmd->intv_max = MS_TO_BLESLOTS(RX_ON_ADV_INTERVAL);
	  cmd->channel_map = ADV_ALL_CHNLS_EN;

#if defined (__DA14531__)  // Power output change is possible for DA14531 only	
		rf_pa_pwr_set(RX_ON_ADV_POWER);
	  set_recommended_settings();
#endif	

    if(adv_state_before == MOTION_ADVERTISING){
  	  mnf_data.proprietary_data[2] = RX_ON_MOTION_ADV_HEADER;
		} else{
			mnf_data.proprietary_data[2] = RX_ON_STATIC_ADV_HEADER;
		}
    mnf_data.proprietary_data[9] = CalculateCRC(&mnf_data.proprietary_data[1], 8); // Checksum
		
    // Add manufacturer data to initial advertising or scan response data, if there is enough space
    app_add_ad_struct(cmd, &mnf_data, sizeof(struct mnf_specific_data_ad_structure), 1);

    app_easy_gap_undirected_advertise_start();
	
		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		  uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			arch_printf("\n\r[%08d us] 2.RX_ON_adv_start... Header: %02X RX_ON_Hanldler: %02X", current_sys_tick, mnf_data.proprietary_data[2], user_periodic_rx_on_timer);
		#endif
	
