dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
}

/**
 ****************************************************************************************
 * @brief Start rsp undirected advertising                
 * @return void
 ****************************************************************************************
*/ 
void user_rsp_undirect_adv_start(void)
{
    // Schedule the rsp advertising cancellation
    user_rsp_cancel_timer = app_easy_timer(RSP_CANCEL_TIMER, rsp_cancel_timer_cb);

	  struct gapm_start_advertise_cmd* cmd;
    cmd = app_easy_gap_undirected_advertise_get_active();
    
		cmd->intv_min = MS_TO_BLESLOTS(RSP_ADV_INTERVAL);
		cmd->intv_max = MS_TO_BLESLOTS(RSP_ADV_INTERVAL);
	  cmd->channel_map = ADV_CHNL_37_EN;
		//cmd->channel_map = ADV_ALL_CHNLS_EN;
	
#if defined (__DA14531__)  // Power output change is possible for DA14531 only	
		rf_pa_pwr_set(RSP_ADV_POWER);
	  set_recommended_settings();
#endif

  	// Add manufacturer data to initial advertising or scan response data, if there is enough space
    app_add_ad_struct(cmd, &mnf_data, sizeof(struct mnf_specific_data_ad_structure), 1);

    app_easy_gap_undirected_advertise_start();
	
		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		  uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			arch_printf("\n\r[%08d us] 7.User_RSP_undirect_adv_start...", current_sys_tick);
		#endif
	
}

/**
 ****************************************************************************************
 * @brief Start device info undirected advertising                
 * @return void
 ****************************************************************************************
*/ 
void user_dev_info_undirect_adv_start(void)
{
    // Schedule the device info advertising cancellation
    user_dev_info_cancel_timer = app_easy_timer(DEV_INFO_CANCEL_TIMER, dev_info_cancel_timer_cb);

	  struct gapm_start_advertise_cmd* cmd;
    cmd = app_easy_gap_undirected_advertise_get_active();
    
		cmd->intv_min = MS_TO_BLESLOTS(DEV_INFO_ADV_INTERVAL);
		cmd->intv_max = MS_TO_BLESLOTS(DEV_INFO_ADV_INTERVAL);
		cmd->channel_map = ADV_ALL_CHNLS_EN;
	
#if defined (__DA14531__)  // Power output change is possible for DA14531 only	
		rf_pa_pwr_set(DEV_INFO_ADV_POWER);
	  set_recommended_settings();
#endif

    dev_info_adv_data_init();

	// Add manufacturer data to initial advertising or scan response data, if there is enough space
    app_add_ad_struct(cmd, &mnf_data, sizeof(struct mnf_specific_data_ad_structure), 1);

    app_easy_gap_undirected_advertise_start();
	
		#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		  uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			arch_printf("\n\r[%08d us] 9.User_DEV_INFO_undirect_adv_start...", current_sys_tick);
		#endif
	
}

/**
 ****************************************************************************************
 * @brief Send the device to sleep.
 * @return void
 ****************************************************************************************
*/                   
void user_enable_extended_sleep(void)
{
    arch_ble_ext_wakeup_on();
	//TBD: set here instruction to go to HIBERNATION
}

/**
 ****************************************************************************************
 * @brief Function to set the advertising state
 * @return void
 ****************************************************************************************
*/
void user_change_adv_state(advertising_state state)
{
	switch (state)
	{
			case MOTION_ADVERTISING:
					adv_state = MOTION_ADVERTISING;
					break;
			case STATIC_ADVERTISING:
					adv_state = STATIC_ADVERTISING;
					break;
			case RX_ON_ADVERTISING:
					adv_state = RX_ON_ADVERTISING;
					break;
			case RSP_ADVERTISING:
					adv_state = RSP_ADVERTISING;
					break;
			case SLEEP:
					adv_state = SLEEP;
					#ifdef CFG_PRINTF
							arch_puts("\n\n\rSystem going to sleep...");
					#endif
					break;
			case DEV_INFO:
					adv_state = DEV_INFO;
					break;
			default :
					adv_state = MOTION_ADVERTISING;
					break;
	}	
}

static void _user_app_sensor_init()
{
    /* Variable to report error */
	#ifdef CFG_PRINTF
    int8_t rslt;
	#endif

	#if 0
    struct bmi2_sens_config config[2] = {0};
    
     /* Array to select sensors */
    uint8_t sens_list[3] = { BMI2_ACCEL, BMI2_NO_MOTION, BMI2_ANY_MOTION };
    
    struct bmi2_int_pin_config int_cfg;
    
    int_cfg.pin_type = BMI2_INT1;
    int_cfg.int_latch = 0;
    int_cfg.pin_cfg[0].lvl = 1;
    int_cfg.pin_cfg[0].output_en = 1;
    int_cfg.pin_cfg[0].od = 1;
    
    /* Select features and their pins to be mapped to */
    struct bmi2_sens_int_config sens_int[2] = { 
        {.type = BMI2_NO_MOTION, .hw_int_pin = BMI2_INT1},
        {.type = BMI2_ANY_MOTION, .hw_int_pin = BMI2_INT1}
    };
    
    
    port_bmi270_itf_begin();
    
    // Initialize the sensor
    port_bmi270_init();
    
    // Enable the sensors of interest
    bmi2_sensor_enable(sens_list, 3, port_bmi270_dev_ptr());
    
    config[0].type = BMI2_NO_MOTION;
    config[1].type = BMI2_ANY_MOTION;

    bmi2_set_int_pin_config(&int_cfg,port_bmi270_dev_ptr());
    
    /* Get default configurations for the type of feature selected */
    bmi2_get_sensor_config(config, 2, port_bmi270_dev_ptr());

    /* Set the new configuration */
    bmi2_set_sensor_config(config, 2, port_bmi270_dev_ptr());
    
    // Enable the sensor interrupts of interest
    bmi2_map_feat_int(sens_int, 2, port_bmi270_dev_ptr());

    port_bmi270_itf_end();
    #else
    uint8_t var;
    uint8_t feat_cfg[4];
    
    // Start communication
    port_bmi270_itf_begin();
    
    // Initialize the sensor
    port_bmi270_init();

    /* Feature Configuration */
    bmi2_set_adv_power_save(BMI2_DISABLE,  port_bmi270_dev_ptr());
    
    var = 0x01; // go to page 1
    bmi2_set_regs(BMI2_FEAT_PAGE_ADDR, &var, 1, port_bmi270_dev_ptr());
    
    // Any motion feature configuration
    bmi2_get_regs(BMI2_FEATURES_REG_ADDR + 0x0C, (uint8_t*)feat_cfg, 4, port_bmi270_dev_ptr());
    feat_cfg[3] |= 0x80; // Enabling the any motion feature
    bmi2_set_regs(BMI2_FEATURES_REG_ADDR + 0x0C, (uint8_t*)feat_cfg, 4, port_bmi270_dev_ptr());

    var = 0x02; // go to page 2
    bmi2_set_regs(BMI2_FEAT_PAGE_ADDR, &var, 1, port_bmi270_dev_ptr());
    
    // No motion feature configuration
    bmi2_get_regs(BMI2_FEATURES_REG_ADDR, (uint8_t*)feat_cfg, 4, port_bmi270_dev_ptr());
//    feat_cfg[0] = 0xFE;      // Setting the no motion threshold to 5 seconds @ 50Hz
    feat_cfg[0] = 0xB0;      // Setting the no motion threshold to 20 seconds LSB => 20000ms/20ms=1000 => 0x03E8 @ 50Hz
    feat_cfg[1] |= 0x04;      // Setting the no motion threshold to 20 seconds MSB (duration is 12 bit, higher bits are x,y,z enable bits) @ 50Hz		
    feat_cfg[3] |= 0x80; // Enabling the no motion feature
    bmi2_set_regs(BMI2_FEATURES_REG_ADDR, (uint8_t*)feat_cfg, 4, port_bmi270_dev_ptr());
    
	#ifdef CFG_PRINTF
    rslt = bmi2_set_adv_power_save(BMI2_ENABLE,  port_bmi270_dev_ptr());
		
	arch_printf("\n\n\r bmi2_set_adv_power_save = %s", rslt==0? "OK":"NOT OK");
	#endif
    
    var = 0x00; // latched
    bmi2_set_regs(BMI2_INT_LATCH_ADDR, &var, 1, port_bmi270_dev_ptr());
    
    var = 0x20 | 0x40; // no_motion | any_motion
    bmi2_set_regs(BMI2_INT1_MAP_FEAT_ADDR, &var, 1, port_bmi270_dev_ptr());
    
