dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
//    var = 0x02 | 0x08; // active_high | push_pull | output_enabled
    var = 0x00 | 0x08; // active_low | push_pull | output_enabled		
    bmi2_set_regs(BMI2_INT1_IO_CTRL_ADDR, &var, 1, port_bmi270_dev_ptr());

//    var = 0x07; // acc_conf at 50Hz and low power mode
		bmi2_set_regs(BMI2_ACC_CONF_ADDR, &var, 1, port_bmi270_dev_ptr());
    
    var = 0x04; // acc_enable
    bmi2_set_regs(BMI2_PWR_CTRL_ADDR, &var, 1, port_bmi270_dev_ptr());

    // End communication
    port_bmi270_itf_end();
    
    #endif
}




// Configuration struct for Flash SPI
static const spi_cfg_t flash_spi_cfg = {
    .spi_ms = SPI_MS_MODE_MASTER,
    .spi_cp = SPI_CP_MODE_0,
    .spi_speed = SPI_SPEED_MODE_4MHz,
    .spi_wsz = SPI_MODE_8BIT,
    .spi_cs = SPI_CS_0,
    .cs_pad.port = SPI_EN_PORT,
    .cs_pad.pin = SPI_EN_PIN,
#if defined (__DA14531__)
    .spi_capture = SPI_MASTER_EDGE_CAPTURE,
#endif
#if defined (CFG_SPI_DMA_SUPPORT)
    .spi_dma_channel = SPI_DMA_CHANNEL_01,
    .spi_dma_priority = DMA_PRIO_0,
#endif
};

// SPI Flash device parameters environment(P25Q11U)
static const spi_flash_cfg_t flash_cfg_env = {

    .dev_index = 0x10,
    .jedec_id = 0x854011, 
	  .chip_size = 0x20000,
};


void flash_itf_de_init(void)
{

    GPIO_ConfigurePin(SPI_EN_PORT,  SPI_EN_PIN,  OUTPUT, PID_GPIO, true);
    GPIO_ConfigurePin(SPI_CLK_PORT, SPI_CLK_PIN, INPUT, PID_GPIO, false);
    GPIO_ConfigurePin(SPI_DO_PORT, SPI_DO_PIN, INPUT, PID_GPIO, false);
	  GPIO_ConfigurePin(SPI_DI_PORT, SPI_DI_PIN, INPUT_PULLDOWN, PID_GPIO, false);
    
    spi_release();
}

void flash_itf_init(void)
{
    GPIO_ConfigurePin(SPI_EN_PORT,  SPI_EN_PIN,  OUTPUT, PID_SPI_EN, true);
    GPIO_ConfigurePin(SPI_CLK_PORT, SPI_CLK_PIN, OUTPUT, PID_SPI_CLK, false);
    GPIO_ConfigurePin(SPI_DO_PORT, SPI_DO_PIN, OUTPUT, PID_SPI_DO, false);
	  GPIO_ConfigurePin(SPI_DI_PORT, SPI_DI_PIN, INPUT_PULLDOWN, PID_SPI_DI, false);

	  spi_flash_configure_env(&flash_cfg_env); 
  	spi_initialize(&flash_spi_cfg);
}

void user_app_on_db_init_complete(void)
{
#ifdef CFG_PRINTF
 arch_printf("\n\n\r user_app_on_db_init_complete");
#endif	
	
#ifdef HAS_WKUP_KEYS
    wkup_keys_setup();
#endif // HAS_WKUP_KEYS
    
    _user_app_sensor_init();
	

		flash_itf_init();
	  spi_flash_power_down();
    user_app_adv_start();
}


static void _user_pb1_long_press_handler()
{
	app_push_button_timer = EASY_TIMER_INVALID_TIMER;

	#ifdef CFG_PRINTF
			arch_printf("\n\n\r Button pressed > %d sec...\n",APP_BUTTON_LONG_PRESS_TO/100);
	#endif
}

static void _user_pb1_key_handler(bool pressed)
{
	uint8_t int_feat_enable = 0;

	if(pressed) 
		{ // Do something when button is firstly pressed
			// Start timer to check about long press
			app_push_button_timer = app_easy_timer(APP_BUTTON_LONG_PRESS_TO, _user_pb1_long_press_handler);

#if (WKUP_KEYS_NUM > 1)			

			// Cancel Motion_Sleep_timeout timer	
			if(user_enable_extended_sleep_timer != EASY_TIMER_INVALID_TIMER)
			{
					app_easy_timer_cancel(user_enable_extended_sleep_timer);
					user_enable_extended_sleep_timer = EASY_TIMER_INVALID_TIMER;		
			}

			#ifdef CFG_PRINTF
			arch_printf("\n\n\r Button pressed: Started long press timer and cancelled Sleep timer...\n");
			#endif

#endif

		} 
	else
		{ // Button Released

			// Clear the long press timer if we did not reach the long press timeout
			if(app_push_button_timer != EASY_TIMER_INVALID_TIMER) 
				{ //Released after a Short press
					app_easy_timer_cancel(app_push_button_timer);
					app_push_button_timer = EASY_TIMER_INVALID_TIMER;

#if (WKUP_KEYS_NUM > 1)
			
					#ifdef CFG_PRINTF
						arch_printf("\n\n\r Button released after a short press...\n");
					#endif
	
						if (adv_state_before == MOTION_ADVERTISING && !arch_ble_ext_wakeup_get())				
						{// If already in MOTION ADVERTISING do nothing (accelerometer is taking care)
							#ifdef CFG_PRINTF
							arch_printf("\n\n\r Motion adv still on, do nothing as accelerometer is in NO_MOTION detect mode\n");
							#endif
						}
						else
							{
							int_feat_enable = 0x20; // enable the NO_MOTION interrupt and disable the ANY_MOTION
							arch_set_sleep_mode(app_default_sleep_mode);
							arch_ble_force_wakeup();
							adv_state = MOTION_ADVERTISING;
							user_periodic_timer_init_once = 1;
							//cancel_motion_adv = 1;

							if (adv_state == SLEEP || arch_ble_ext_wakeup_get())
								{// If we are in sleep => Wake up from sleep
									 #ifdef CFG_PRINTF
									 arch_printf("\n\n\rWake up from SLEEP due to Button press");
									 arch_printf("\n\n\rRestart Motion adv\n");
									 #endif
									 arch_ble_ext_wakeup_off();
									 user_app_adv_start();			
								}	
							else
								{// Switch to motion advertising
									 #ifdef CFG_PRINTF
									 arch_printf("\n\n\rSwitch to Motion adv due to Button press");
									 #endif
									 app_easy_gap_advertise_stop();
								}

							} // end of adv_state_before =! MOTION_ADVERTISING
#endif					
        }// End of Released after a Short press
			else 
				{//Released after a Long press

#if (WKUP_KEYS_NUM > 1)				
					if (adv_state != SLEEP)
						{
							// Go to sleep
							int_feat_enable = 0x40; // enable the ANY_MOTION interrupt and disable the NO_MOTION
							#ifdef CFG_PRINTF
							arch_puts("\n\n\rSet Sensor to ANY_MOTION detection, Stop adv and going to sleep...\n");
							#endif
							adv_state = SLEEP;
//							app_easy_gap_advertise_stop();
              user_enable_extended_sleep();
							user_ble_gap_stop_ongoing_operation();
						}
					else
						{
							// if system is already in SLEEP this point will never been reached as app_push_button_timer is not started
						}
#endif

			  } // End of Released after a Long press

// Due to the fact that PB1 is shared with SDA pin, below feature needs to implement I2C release feature and right now cannot be used
#if (WKUP_KEYS_NUM > 1)
				if(int_feat_enable) {
						// Do the interrupt updating if needed
						port_bmi270_itf_begin();
						bmi2_set_regs(BMI2_INT1_MAP_FEAT_ADDR, &int_feat_enable, 1, port_bmi270_dev_ptr());
						port_bmi270_itf_end();
						#ifdef CFG_PRINTF
								arch_puts("\n\n\r Do Interrupt updating...\n");
						#endif
				}
#endif
		}// End of Button Released
}

