dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
static void _user_inertial_handle_interrupt()
{
    uint8_t int0_status;
    uint8_t int_feat_enable = 0;
    
		arch_set_sleep_mode(app_default_sleep_mode);
		arch_ble_force_wakeup();

	  port_bmi270_itf_begin();
    bmi2_get_regs(BMI2_INT_STATUS_0_ADDR, &int0_status, 1, port_bmi270_dev_ptr());
    port_bmi270_itf_end();
    
  	// Check which interrupt we have received
  	if(int0_status & BMI270_ANY_MOT_STATUS_MASK) {
        // ANY_MOTION interrupt received wake up from sleep or switch to MOTION ADV
        int_feat_enable = 0x20; // enable the NO_MOTION interrupt and disable the ANY_MOTION
			
				if (adv_state == SLEEP || arch_ble_ext_wakeup_get())
					{// Wake up from sleep
					 #ifdef CFG_PRINTF
						arch_printf("\n\n\rWake up from SLEEP due to interrupt received");
						arch_printf("\n\n\rRestart Motion adv\n");
					 #endif
						arch_ble_ext_wakeup_off();
				    adv_state = MOTION_ADVERTISING;
		        // This flag will recharge user_sleep_timout_timer with TIMEOUT_FOR_SLEEP and RX_ON timer with RX_ON value
		        user_periodic_timer_init_once = 1;
						user_app_adv_start();			
					}	
        else
					{// Switch to MOTION ADV
					 #ifdef CFG_PRINTF
						arch_printf("\n\n\rSwitch to Motion adv\n");
					 #endif
				    adv_state = MOTION_ADVERTISING;
		        // This flag will recharge user_sleep_timout_timer with TIMEOUT_FOR_SLEEP and RX_ON timer with RX_ON value
		        user_periodic_timer_init_once = 1;
						app_easy_gap_advertise_stop(); // Stop Static ADV
					}
        
    } else if(int0_status & BMI270_NO_MOT_STATUS_MASK) {
        // Timeout for NO_MOTION elapsed got to Static Adv!
        int_feat_enable = 0x40; // enable the ANY_MOTION interrupt and disable the NO_MOTION
				cancel_motion_adv = 1;
    }
    
    if(int_feat_enable) {
        // Do the interrupt updating
        port_bmi270_itf_begin();
        bmi2_set_regs(BMI2_INT1_MAP_FEAT_ADDR, &int_feat_enable, 1, port_bmi270_dev_ptr());
        port_bmi270_itf_end();
    }
}
		
#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
/* return static buffer with formatted hex string */
static char *format_hex_string(uint8_t *data, uint8_t len)	
{
	static char buf[61];
	uint8_t i;
	for(i = 0; i < len; i++)
	{
		sprintf(&buf[i*2], "%02x", data[i]);
	}
	
	buf[(i+1)*2+1] = '\0';
	
	return buf;
}
#endif

void user_on_adv_report_ind(struct gapm_adv_report_ind const * param)
{
    const uint8_t user_man_comp_f1_id[] = MAN_QUUPPA_COMP_F1_ID;
	  uint8_t reverse_bd_addr[6];
    uint8_t temp_report_data[ADV_DATA_LEN + 1];

    memcpy(temp_report_data, param->report.data, param->report.data_len);
    temp_report_data[param->report.data_len] = '\0';
	
	  reverse_bd_addr[5] = own_bd_addr [0];
	  reverse_bd_addr[4] = own_bd_addr [1];	  
	  reverse_bd_addr[3] = own_bd_addr [2];
	  reverse_bd_addr[2] = own_bd_addr [3];	
		reverse_bd_addr[1] = own_bd_addr [4];
	  reverse_bd_addr[0] = own_bd_addr [5];	
	
			#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
			//arch_printf("\r\n5.ADV: %s", format_hex_string(temp_report_data, param->report.data_len));
	  	#endif

//    // Check if the Adv Report is a REQ packet coming from Quuppa locator and is referred to own BD Address
//    if(!memcmp(report_data + 4, user_man_comp_f1_id, 4) && !memcmp(report_data + 9, reverse_bd_addr, 6))

// Check if the Adv Report is a REQ packet coming from Quuppa locator
	  if(!memcmp(temp_report_data + 4, user_man_comp_f1_id, 4))
			{
			#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
  			uint16_t DeveloperID;
				memcpy(&DeveloperID, &temp_report_data[16], sizeof(uint16_t));
		    uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			  arch_printf("\n\r[%08d us] 5.REQ F1 found,", current_sys_tick);
  			arch_printf("\r\n              5.Raw Data: %s", format_hex_string(temp_report_data, param->report.data_len));
  			arch_printf("\r\n              5.Header: %02x, Payload Type: %02x, DevID: %04x, Data: %s", temp_report_data[8], temp_report_data[15], DeveloperID, format_hex_string(temp_report_data + 16, param->report.data_len-16));
	      arch_printf("\r\n              5.BD Tgt: %s , BD Own: %s", format_hex_string(temp_report_data + 9, 6), format_hex_string(reverse_bd_addr, 6));
			#endif
    // Check if is referred to own BD Address
    if(!memcmp(temp_report_data + 9, reverse_bd_addr, 6))
			{
			#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		    uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	      arch_printf("\r\n[%08d us] 5.BD Tgt: %s = BD Own: %s => STOP SCAN", current_sys_tick, format_hex_string(temp_report_data + 9, 6), format_hex_string(reverse_bd_addr, 6));
			#endif
      req_found = true;
      memcpy(report_data, temp_report_data, param->report.data_len);
			report_data[param->report.data_len] = '\0';
			
         // Check the Payload Type
		     switch(report_data[15])
		     { 
					case BACK_CHANNEL_INFO: // Payload Type: 0x02
					{
				    #if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		         uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			       arch_printf("\n\r[%08d us] 5.Payload Type: 0x02 Back Channel Info received", current_sys_tick);
				    #endif

						mnf_data.proprietary_data[0] = 0xF2; // Quuppa Packet ID: 0xF2 = RSP Packet;
						mnf_data.proprietary_data[1] = report_data[8]; // Header containing the REQ/RSP Pair ID
						mnf_data.proprietary_data[2] = own_bd_addr[5]; // Quuppa Tag ID [MSB]	
						mnf_data.proprietary_data[3] = own_bd_addr[4]; // Quuppa Tag ID
						mnf_data.proprietary_data[4] = own_bd_addr[3]; // Quuppa Tag ID
						mnf_data.proprietary_data[5] = own_bd_addr[2]; // Quuppa Tag ID
						mnf_data.proprietary_data[6] = own_bd_addr[1]; // Quuppa Tag ID		
						mnf_data.proprietary_data[7] = own_bd_addr[0]; // Quuppa Tag ID [LSB]
						mnf_data.proprietary_data[8] = 0x02;  // Payload Type: 0x02 Back Channel Info 
						mnf_data.proprietary_data[9] = 0x5B;  // Back Channel Spec Number minor: 91 
						mnf_data.proprietary_data[10] = 0x00; // Back Channel Spec Number major: 00 
						mnf_data.proprietary_data[11] = DEVELOPER_ID & 0xFF; // Developer ID [LSB]
						mnf_data.proprietary_data[12] = (DEVELOPER_ID >> 8 )& 0xFF; // Developer ID [MSB]
						mnf_data.proprietary_data[13] = 0x00; // Developer Data 1
						mnf_data.proprietary_data[14] = 0x00; // Developer Data 2
						mnf_data.proprietary_data[15] = 0x00; // Developer Data 3		
						mnf_data.proprietary_data[16] = 0x00; // Developer Data 4
						mnf_data.proprietary_data[17] = 0x00; // Developer Data 5
						mnf_data.proprietary_data[18] = 0x00; // Developer Data 6
						mnf_data.proprietary_data[19] = 0x00; // Developer Data 7	
						mnf_data.proprietary_data[20] = 0x00; // Developer Data 8
						mnf_data.proprietary_data[21] = 0x00; // Developer Data 9
						mnf_data.proprietary_data[22] = 0x00; // Developer Data 10
						mnf_data.proprietary_data[23] = 0x00; // Developer Data 11
						
						break;
					}
					case DEVICE_INFO: // Payload Type: 0x01
					{
				    #if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		         uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			       arch_printf("\n\r[%08d us] 5.Payload Type: 0x01 Device Info received", current_sys_tick);
				    #endif

						get_device_info();
						
						mnf_data.proprietary_data[0] = 0xF2; // Quuppa Packet ID: 0xF2 = RSP Packet;
						mnf_data.proprietary_data[1] = report_data[8]; // Header containing the REQ/RSP Pair ID
						mnf_data.proprietary_data[2] = own_bd_addr[5]; // Quuppa Tag ID [MSB]	
						mnf_data.proprietary_data[3] = own_bd_addr[4]; // Quuppa Tag ID
						mnf_data.proprietary_data[4] = own_bd_addr[3]; // Quuppa Tag ID
						mnf_data.proprietary_data[5] = own_bd_addr[2]; // Quuppa Tag ID
						mnf_data.proprietary_data[6] = own_bd_addr[1]; // Quuppa Tag ID		
						mnf_data.proprietary_data[7] = own_bd_addr[0]; // Quuppa Tag ID [LSB]
						mnf_data.proprietary_data[8] = 0x01;  // Payload Type: 0x01 Device Info 
						mnf_data.proprietary_data[9] = 0x00;  // Version 
						mnf_data.proprietary_data[10] = 0x1B; // Supported features (1 = supported, Bit[7-0]=[RFU, RFU, RFU, Temp, Battery, Btn2=NA=0, Btn1, Battery Alarm])  
						mnf_data.proprietary_data[11] = ui8status; // Status	(Bit[7-0]=[RFU,..., Btn2=NA=0, Btn1(1=pressed), Battery Alarm(0=Battery OK, 1=Battery Low)]) 
						mnf_data.proprietary_data[12] = ui16battery_CR2032_mv & 0xFF; // Battery Voltage [LSB]
						mnf_data.proprietary_data[13] = (ui16battery_CR2032_mv >> 8 )& 0xFF; // Battery Voltage [MSB] => 0x0BB8 = 3.00V (1mV per bit, 0x0000 if not supported and 0 in supp feat bit)
						mnf_data.proprietary_data[14] = ui16temperature_k & 0xFF; // Temperature [LSB]     => Formula (hex)(C + 273.15)*10 => (20.0C + 273.15)*10 = 2931.5 (hex)(2932) = 0x0B74  
						mnf_data.proprietary_data[15] = (ui16temperature_k >> 8 )& 0xFF; // Temperature [MSB]     => 0x0B74 = 20.0C (0.1Kelvin per bit, 0x0000 if not supported and 0 in supp feat bit)		
						mnf_data.proprietary_data[16] = DEVELOPER_ID & 0xFF; // Developer ID [LSB]
						mnf_data.proprietary_data[17] = (DEVELOPER_ID >> 8 )& 0xFF; // Developer ID [MSB]
						mnf_data.proprietary_data[18] = 0x00; // FW Version [LSB]
						mnf_data.proprietary_data[19] = 0x01; // FW Version [MSB]	  => FW verion 1.0
						mnf_data.proprietary_data[20] = 0x00; // HW Version [LSB]
						mnf_data.proprietary_data[21] = 0x01; // HW Version [MSB]	  => HW verion 1.0
						mnf_data.proprietary_data[22] = 0x00; // RFU
						mnf_data.proprietary_data[23] = 0x00; // RFU
						
						break;
					}

