dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
					case DEVELOPER_SPECIFIC: // Payload Type: 0xFF
					{
				    #if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		         uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			       arch_printf("\n\r[%08d us] 5.Payload Type: 0xFF Developer Specific received", current_sys_tick);
				    #endif

            // Prepare manufacturer specific data general part
						mnf_data.proprietary_data[0] = 0xF2; // Quuppa Packet ID: 0xF2 = RSP Packet;
						mnf_data.proprietary_data[1] = report_data[8]; // Header containing the REQ/RSP Pair ID
						mnf_data.proprietary_data[2] = own_bd_addr[5]; // Quuppa Tag ID [MSB]	
						mnf_data.proprietary_data[3] = own_bd_addr[4]; // Quuppa Tag ID
						mnf_data.proprietary_data[4] = own_bd_addr[3]; // Quuppa Tag ID
						mnf_data.proprietary_data[5] = own_bd_addr[2]; // Quuppa Tag ID
						mnf_data.proprietary_data[6] = own_bd_addr[1]; // Quuppa Tag ID		
						mnf_data.proprietary_data[7] = own_bd_addr[0]; // Quuppa Tag ID [LSB]
						mnf_data.proprietary_data[8] = 0xFF;  // Payload Type: 0xFF Developer Specific 
						mnf_data.proprietary_data[9] =  DEVELOPER_ID & 0xFF; // Developer ID [LSB]
						mnf_data.proprietary_data[10] = (DEVELOPER_ID >> 8 )& 0xFF; // Developer ID [MSB]  

            // Check which command has been received
		        switch(report_data[18])
						{
    					case 0x01:
    					{
                // Execute command
                toggle_led();
								#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
		              uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
			            arch_printf("\n\r[%08d us] 5.Command LED Toggled executed", current_sys_tick);
			          #endif
                // Prepare the rest of the payload
								mnf_data.proprietary_data[11] = 0x01;      // Command type: 0x01 = Toggle LED
								mnf_data.proprietary_data[12] = led_state; // Report the current status of LED
								mnf_data.proprietary_data[13] = 0x00; // Developer Data 2
								mnf_data.proprietary_data[14] = 0x00; // Developer Data 3
								mnf_data.proprietary_data[15] = 0x00; // Developer Data 4		
								mnf_data.proprietary_data[16] = 0x00; // Developer Data 5
								mnf_data.proprietary_data[17] = 0x00; // Developer Data 6
								mnf_data.proprietary_data[18] = 0x00; // Developer Data 7
								mnf_data.proprietary_data[19] = 0x00; // Developer Data 8	
								mnf_data.proprietary_data[20] = 0x00; // Developer Data 9
								mnf_data.proprietary_data[21] = 0x00; // Developer Data 10
								mnf_data.proprietary_data[22] = 0x00; // Developer Data 11
								mnf_data.proprietary_data[23] = 0x00; // Developer Data 12

								break;
							}

							default: //RFU
							{
								mnf_data.proprietary_data[11] = 0x00; // Developer Data 0
								mnf_data.proprietary_data[12] = 0x00; // Developer Data 1
								mnf_data.proprietary_data[13] = 0x00; // Developer Data 2
								mnf_data.proprietary_data[14] = 0x00; // Developer Data 3
								mnf_data.proprietary_data[15] = 0x00; // Developer Data 4		
								mnf_data.proprietary_data[16] = 0x00; // Developer Data 5
								mnf_data.proprietary_data[17] = 0x00; // Developer Data 6
								mnf_data.proprietary_data[18] = 0x00; // Developer Data 7
								mnf_data.proprietary_data[19] = 0x00; // Developer Data 8	
								mnf_data.proprietary_data[20] = 0x00; // Developer Data 9
								mnf_data.proprietary_data[21] = 0x00; // Developer Data 10
								mnf_data.proprietary_data[22] = 0x00; // Developer Data 11
								mnf_data.proprietary_data[23] = 0x00; // Developer Data 12
								
								break;
							}

						}
						break; // DEVELOPER_SPECIFIC
					}					

					default: //UNSUPPORTED_REQ
					{
				    #if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
              uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	            arch_printf("\n\r[%08d us] 5.Payload Type: 0x00 Unsupported REQ received", current_sys_tick);
				    #endif

						mnf_data.proprietary_data[0] = 0xF2; // Quuppa Packet ID: 0xF2 = RSP Packet;
						mnf_data.proprietary_data[1] = report_data[8]; // Header containing the REQ/RSP Pair ID
						mnf_data.proprietary_data[2] = own_bd_addr[5]; // Quuppa Tag ID [MSB]	
						mnf_data.proprietary_data[3] = own_bd_addr[4]; // Quuppa Tag ID
						mnf_data.proprietary_data[4] = own_bd_addr[3]; // Quuppa Tag ID
						mnf_data.proprietary_data[5] = own_bd_addr[2]; // Quuppa Tag ID
						mnf_data.proprietary_data[6] = own_bd_addr[1]; // Quuppa Tag ID		
						mnf_data.proprietary_data[7] = own_bd_addr[0]; // Quuppa Tag ID [LSB]
						mnf_data.proprietary_data[8] = 0x00;  // Payload Type: 0x00 Unsupported REQ 
						mnf_data.proprietary_data[9] = 0x5B;  // Back Channel Spec Number minor: 91 
						mnf_data.proprietary_data[10] = 0x00; // Back Channel Spec Number major: 00 
						mnf_data.proprietary_data[11] = DEVELOPER_ID & 0xFF; // Developer ID [LSB]
						mnf_data.proprietary_data[12] = (DEVELOPER_ID >> 8 )& 0xFF; // Developer ID [MSB] 
						mnf_data.proprietary_data[13] = 0x00; // Developer Data 1
						mnf_data.proprietary_data[14] = 0x00; // Developer Data 2
						mnf_data.proprietary_data[15] = 0x00; // Developer Data 3		
						mnf_data.proprietary_data[16] = 0x00; // Developer Data 4
						mnf_data.proprietary_data[17] = 0x00; // Developer Data 5
						mnf_data.proprietary_data[18] = 0x00; // Developer Data 6
						mnf_data.proprietary_data[19] = 0x00; // Developer Data 7	
						mnf_data.proprietary_data[20] = 0x00; // Developer Data 8
						mnf_data.proprietary_data[21] = 0x00; // Developer Data 9
						mnf_data.proprietary_data[22] = 0x00; // Developer Data 10
						mnf_data.proprietary_data[23] = 0x00; // Developer Data 11
						
						break;
					}
        }	// switch(report_data[15])			
				#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
					current_sys_tick = SYSTICK_PERIOD_US - systick_value();
					arch_printf("\n\r[%08d us] 5.Stop Scan", current_sys_tick);
				#endif
				user_ble_gap_stop_ongoing_operation();	
			} //if(!memcmp(temp_report_data + 9, reverse_bd_addr, 6))
		} //if(!memcmp(temp_report_data + 4, user_man_comp_f1_id, 4))
}

/**
 ****************************************************************************************
 * @brief Callback from SDK when disconnect occurs.
 * @param[in] reason reason for disconnect BT SIG reason defined in co_error.h
 * @return void
 ****************************************************************************************
 */
void user_on_scanning_completed(uint8_t reason)
{
			#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
         uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
	       arch_printf("\n\r[%08d us] 6.Scanning completed", current_sys_tick);
			#endif

