dialog-semiconductor/BLE_SDK6_examples/connectivity/Quuppa_DialogTag/src/DA14531_Quuppa_DF_BckChn_FlexBeacon.c
	if (adv_state != SLEEP)
		{
			if(reason == GAP_ERR_CANCELED)
				{
					#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
						 uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
						 arch_printf("\n\r[%08d us] 6.Scanning cancelled", current_sys_tick);
					#endif
		 
					if (user_scan_cancel_timer != EASY_TIMER_INVALID_TIMER)
						{
								app_easy_timer_cancel(user_scan_cancel_timer);
								user_scan_cancel_timer = EASY_TIMER_INVALID_TIMER;
						}

					if (req_found == false)
						{
						 #if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
							 uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
							 arch_printf("\n\r[%08d us] 6.No REQ packet received", current_sys_tick);
						 #endif

						 user_change_adv_state(DEV_INFO);
						}
					if (req_found == true)
						{
						 #if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
							 uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
							 arch_printf("\n\r[%08d us] 6.REQ packet received, start sending RSP", current_sys_tick);
						 #endif
						 user_change_adv_state(RSP_ADVERTISING);
						 req_found = false;
						}
					user_app_adv_start();
				}
				else
				{
					#if (defined CFG_PRINTF && SHOW_ALL_MESSAGES == 1)
						uint32_t current_sys_tick = SYSTICK_PERIOD_US - systick_value();
						arch_printf("\n\r[%08d us] 6.Scan Error", current_sys_tick);
						arch_printf("\n\r                 %s: ERR: reason: %d", __func__, reason);
		//			arch_puts("\n\rscanning completed, start advertising");
					#endif
				}
			}
}

static void _user_inertial_sensor_int_key_handler(bool pressed)
{
    // If an interrupt from the sensor occurs, go and read the interrupt reason
    // (what gesture is detected)
    if(pressed) {
        _user_inertial_handle_interrupt();
    }
}

#ifdef HAS_WKUP_KEYS
void user_wkup_keys_notification_cb(enum wkup_keys key, bool pressed)
{
    switch(key)
    {
        case PUSH_BUTTON_1_KEY:
            _user_pb1_key_handler(pressed);
            break;
            
        case INERTIAL_SENSOR_INTERRUPT_KEY:
            _user_inertial_sensor_int_key_handler(pressed);
            break;
            
        default:
            ASSERT_ERROR(0);
    }
}
#endif
/// @} APP
